[{"content":"  var _hmt = _hmt || []; (function () { var hm = document.createElement(\"script\"); hm.src = \"https://hm.baidu.com/hm.js?72da874e46df0db06656968a66188744\"; var s = document.getElementsByTagName(\"script\")[0]; s.parentNode.insertBefore(hm, s); })();  X-Core ( https://github.com/PerfXLab/X-Core ) is an open source in-order 5-stage RISC-V 32-bit MCU processor. It supports RV32IM, mainly for RISC-V learning, teaching, and experiments. We use some core codes from PULP RI5CY, and partial SoC peripheral components and SDK from Hummingbird E200.\nX-Core:\n 5-stage pipeline, RV32IM, 50MHz on FPGA board JTAG inferface, supports GDB ITIM: 64KB (configurable), DTIM: 64KB (configurable) QSPI interface for onboard flash Peripheral components, including IIC, UART, SPI, GPIO, PWM, XADC, TIMER.  Benchmark  CoreMark : 2.52 CoreMark/MHz Dhrystone : 1.53 DMIPS/MHz  Download  Bitstream for Perf-V FPGA Board  Support  QQ group: 806854399 Telegram Forum: http://forum.perfv.org/  ","href":"/posts/post-6.html","title":"X-Core: an open source RV32IM MCU processor for Perf-V FPGA Board"},{"content":"  var _hmt = _hmt || []; (function () { var hm = document.createElement(\"script\"); hm.src = \"https://hm.baidu.com/hm.js?72da874e46df0db06656968a66188744\"; var s = document.getElementsByTagName(\"script\")[0]; s.parentNode.insertBefore(hm, s); })();  Perf-V IDE v1.0 for Windows has been released, the Linux version will be released soon. Introduction Perf-V IDE is an integrated development environment built for Perf-V Creative Board. It can be easily operated, and convenient to use. Perf-V IDE is bundled with jre, build tools, RISC-V GCC Toolchain and OpenOCD and can be used to write and debug programs targeting the Perf-V creative board.\nFeatures  Breakpoints can be set in program A running program can be suspended at any time The value of registers can be viewed while the program is suspended The value of variables can be viewed while the program is suspended The assembly code of the program can be viewed while the program is suspended The output of the program can be printed in the terminal view  ","href":"/posts/post-5.html","title":"The Release of Perf-V IDE"},{"content":" var _hmt = _hmt || []; (function () { var hm = document.createElement(\"script\"); hm.src = \"https://hm.baidu.com/hm.js?72da874e46df0db06656968a66188744\"; var s = document.getElementsByTagName(\"script\")[0]; s.parentNode.insertBefore(hm, s); })();  TFT-LCD is the abbreviation for thin film transistor-liquid crystal display. MAR3528 module is 3.5\u0026rdquo; TFT LCD with 262K color 480x 320 resolutions. The controller of this LCD module is ILI9486/ILI9488, it supports 16-wires Data Bus interface. Moreover, this module includes the 5V-3.3V power conversion circuit and Level conversion circuit.\nThe MAR3528 module is connected directly through the Adruino interface with the Perf-V creative board. The TFT screen display function is implemented in C language in the IP core Hummingbird E300, generating executable files through Makefile and downloading them to the project board. Perf-V creative board supports the TFT screen display function, which can realize features such as refresh, GUI rectangle drawing, GUI drawing circle, Chinese and English font display, image display, etc.\n","href":"/posts/post-4.html","title":"New Features of Perf-V Creative Board TFT-LCD Application"},{"content":" var _hmt = _hmt || []; (function () { var hm = document.createElement(\"script\"); hm.src = \"https://hm.baidu.com/hm.js?72da874e46df0db06656968a66188744\"; var s = document.getElementsByTagName(\"script\")[0]; s.parentNode.insertBefore(hm, s); })();  As an interconnection interface, Ethernet interface is widely used nowadays. Ethernet can be seen everywhere from home broadband to server data exchanges to industrial controls. In FPGA system, it is mainly used for high-speed and long-distance data transmission, such as LED large-screen display, monitoring system and so on.\nOn the Perf-V creative board, Ethernet modules can be connected using the high speed to 2.54mm expender. When Ethernet data needs to be sent, FPGA sends the data to PHY chip. After the PHY chip codes the data, the data is loaded to the network line through network transformer. Data is transferred to the receiver via the network. The data sent from the remote end is transmitted to the network transformer through the network cable, and the output of the network transformer is connected to PHY chip. After decoding the signal, the actual data is obtained, and then the data is transmitted to the FPGA chip. As shown in the figure, data transmission is carried out in the Ethernet experiment based on Perf-V creative board. The received characters are HELLO PERFXLAB issued by FPGA, and the actual measured transmission rate is 121*8 MHZ.\n","href":"/posts/post-3.html","title":"New Features of Perf-V Creative Board Gigabit Ethernet Application"},{"content":" var _hmt = _hmt || []; (function () { var hm = document.createElement(\"script\"); hm.src = \"https://hm.baidu.com/hm.js?72da874e46df0db06656968a66188744\"; var s = document.getElementsByTagName(\"script\")[0]; s.parentNode.insertBefore(hm, s); })();  USB(universal serial bus) is a kind of external bus standard used to standardize the connection and communication between computers and external equipment. It is the interface technology applied in PC field. USB interface supports plug-and-play and hot-plug functions of the device.\nOn the Perf-V creative board, USB data transmission can be realized by connecting USB2.0 module with high speed to 2.54mm expender. ","href":"/posts/post-2.html","title":"New Features of Perf-V Creative Board USB2.0 Application"},{"content":" var _hmt = _hmt || []; (function () { var hm = document.createElement(\"script\"); hm.src = \"https://hm.baidu.com/hm.js?72da874e46df0db06656968a66188744\"; var s = document.getElementsByTagName(\"script\")[0]; s.parentNode.insertBefore(hm, s); })();  Welcome to the Perf-V world! Based on the spirit of open-sourcing and the original intention of contributing to the RISC-V related communities, we launched the Perf-V project.\nAs we all know, PerfXLab is a pursuing excellence company that devoutly take \u0026ldquo;Discovering Potential \u0026amp; Driving Performance\u0026rdquo; as our gene. Today, this pursuit is not only carried forward at the layer of our software and algorithms, but also extends to the fundamental hardware layer. Originated from the hobby and in-depth understanding on computer architecture, every colleague that participated in this project has been working with great enthusiasm since the birth of Perf-V, aiming to provide the community and developers with a more flexible, more affordable and more suitable RISC-V engineering board.\nToday, we introduced the first generation of the Perf-V series based on FPGA——Perf-V Model I, and successfully ported and deployed a number of open source RISC-V cores. We also implemented a lot of application demos as the preliminary examples for all developers better understanding and initiating the development of RISC-V cores and applications. We hope that our efforts would contribute to the development and growth of the RISC-V community. We also expect that the field of computer architecture will eventually step into a new era of \u0026ldquo;hardware open source 2.0\u0026rdquo;.\n","href":"/posts/post-1.html","title":"Preface to Perf-V"},{"content":"","href":"/.html","title":""},{"content":" .dropbtn { } .dropdown { position: relative; display: inline-block; } .dropdown-content { display: none; position: absolute; background-color: #ffffff; min-width auto; box-shadow: 0px 4px 8px 0px rgba(0,0,0,0.2); font-weight: 300; } .dropdown-content a { color: black; padding: 12px 16px; text-decoration: none; display: block; } .dropdown-content a:hover { background-color: #f1f1f1 } .dropdown:hover .dropdown-content { display: block; } .dropdown:hover .dropbtn { background-color: #3e8e41; } .wrap { padding: 10px 0 0 10px; width: 100%; overflow: hidden; } .wrap .item { position: relative; float: left; width: 25%; height: 100px; line-height: 80px; text-align: center; border: 1px solid #ffffff; margin-bottom: 10px; } .wrap .item:hover { z-index: 2; border-color: #EFEFEF; } .btn { border: none; font-weight: 400; margin-left: 0px; padding-left: 0px; } .btn:hover { outline: none; border: none; background-color: #FFFFFF; color: #37474f; } .btn:active { border: none; outline: none; background-color: #FFFFFF; color: #37474f; } .btn:focus { outline: none; border: none; background-color: #FFFFFF; color: #47474f; } .perflink { color: #035287; font-weight: 600; } .perflink:hover { text-decoration: underline; color: #035287; }  --  var _hmt = _hmt || []; (function () { var hm = document.createElement(\"script\"); hm.src = \"https://hm.baidu.com/hm.js?72da874e46df0db06656968a66188744\"; var s = document.getElementsByTagName(\"script\")[0]; s.parentNode.insertBefore(hm, s); })();  Company Introduction PerfXLab is an optimization solution company. We provide performance products and services for embedded systems, cloud computing, as well as for artificial intelligence application needs. Our team members come from MIT, Chinese Academy of Sciences, Intel, and NVIDIA, all of them being seasoned developers and researchers in performance optimization. We have led the development of OpenBLAS, as well as the OpenCL module in OpenCV.\nLocation Room 1502, Building A, Jinqiu International Building, No.6 Zhichun Road, Haidian District, Beijing, China\nEmbed Google Map by Measure area on map ","href":"/about.html","title":"About"},{"content":"","href":"/authors.html","title":"Authors"},{"content":"","href":"/categories.html","title":"Categories"},{"content":" .dropbtn { } .dropdown { position: relative; display: inline-block; } .dropdown-content { display: none; position: absolute; background-color: #ffffff; min-width auto; box-shadow: 0px 4px 8px 0px rgba(0,0,0,0.2); font-weight: 300; } .dropdown-content a { color: black; padding: 12px 16px; text-decoration: none; display: block; } .dropdown-content a:hover { background-color: #f1f1f1 } .dropdown:hover .dropdown-content { display: block; } .dropdown:hover .dropbtn { background-color: #3e8e41; } .wrap { padding: 10px 0 0 10px; width: 100%; overflow: hidden; } .wrap .item { position: relative; float: left; width: 25%; height: 100px; line-height: 80px; text-align: center; border: 1px solid #ffffff; margin-bottom: 10px; } .wrap .item:hover { z-index: 2; border-color: #EFEFEF; } .btn { border: none; font-weight: 400; margin-left: 0px; padding-left: 0px; } .btn:hover { outline: none; border: none; background-color: #FFFFFF; color: #37474f; } .btn:active { border: none; outline: none; background-color: #FFFFFF; color: #37474f; } .btn:focus { outline: none; border: none; background-color: #FFFFFF; color: #47474f; } .perflink { color: #035287; font-weight: 600; } .perflink:hover { text-decoration: underline; color: #035287; }  --  var _hmt = _hmt || []; (function () { var hm = document.createElement(\"script\"); hm.src = \"https://hm.baidu.com/hm.js?72da874e46df0db06656968a66188744\"; var s = document.getElementsByTagName(\"script\")[0]; s.parentNode.insertBefore(hm, s); })();  Video demo of RISC-V integrated development environment applied for Perf-V   A demo for an intelligent tracking car implemented with RISC-V based on Perf-V   A demo for gluttonous snake game based on Perf-V   A demo for Real-time display of camera based on Perf-V   A demo for voltage acquisition based on Perf-V   A demo for LED lattice implemented with RISC-V based on Perf-V   Toolchain Introduction  It has a complete compiling and downloading environment, and it is easy to operate.\n How to use (1) Download soft core toperf-v by using vivado (2) The compiler can be compiled by executing the corresponding compiler command with the supplied makefile. As shown in the picture (3) You can download the program to the development board with the supplied makefile and execute the corresponding download command. As shown in the picture. (4) Example: the effect of downloading the tricolor LED program to the board is shown in the following figure:   ","href":"/demo.html","title":"Demo"},{"content":"  var _hmt = _hmt || []; (function () { var hm = document.createElement(\"script\"); hm.src = \"https://hm.baidu.com/hm.js?72da874e46df0db06656968a66188744\"; var s = document.getElementsByTagName(\"script\")[0]; s.parentNode.insertBefore(hm, s); })();  Perf-V  2019, Jul 15\u0026nbsp; \u0026nbsp; \"Perf-V User Manual\"      2019, Jul 15\u0026nbsp; \u0026nbsp; \"Perf-V Schematic\"      2019, Jul 15\u0026nbsp; \u0026nbsp; \"Perf-V PCB\"      2019, Aug 28\u0026nbsp; \u0026nbsp; \"Perf-V IDE installer (in Chinese, baidu disk code: axih)\"    \nSupported RISC-V Cores  X-Core by PerfXLab Hummingbird E200  ","href":"/document.html","title":"Doc"},{"content":"  var _hmt = _hmt || []; (function () { var hm = document.createElement(\"script\"); hm.src = \"https://hm.baidu.com/hm.js?72da874e46df0db06656968a66188744\"; var s = document.getElementsByTagName(\"script\")[0]; s.parentNode.insertBefore(hm, s); })();  Introduction Perf-V is a FPGA demoboard designed for RISC-V opensource community by PerfXLab. It integrates various peripheral chips and offers many interfaces. Perf-V has great flexibility and transplant multiple architectures. We prepare abundant materials for you to learn out product and offer a perfect experiment platform for the design of RISC-V and FPGA products. It is a preferred hardware for you to study, develop programs and make a DEMO.\nFeatures  It uses Xilinx Artix-7 FPGA, Vivado software development,and is designed for the RISC-V open source community and FPGA learning enthusiasts design development board. It Integrates a variety of peripheral chips to provide a rich set of peripheral interfaces, including PMOD, Arduino, JTAG, UART interfaces, and high-speed interfaces for expansion of HDMI, VGA, USB2.0/3.0, camera, Bluetooth, expansion boards, etc. Strong flexibility. Based on Perf-V\u0026rsquo;s self-developed smart car, it can use mobile phone Bluetooth to control the movement of the car, and can realize automatic tracing and obstacle avoidance functions. It successfully ports a variety of RISC-V architectures, providing a good experimental platform for RISC-V processor design and FPGA product development, and is the preferred hardware for learning, scientific research, project development, and DEMO solutions. There is a variety of modules available for selection, powerful, rich learning materials, complete experimental routines, cost-effective; It is for electronic design engineers, hardware DIY enthusiasts, all kinds of enthusiasts, college teachers and students and other groups.  Main Chips  Name Number Chips Features   FPGA 1 XC7A35T-1FTG256C\n(Optional) Logic Cells 33280   DSP 90   CLBs 41600   Block RAM(Kb) 1800   CMTs 5   XC7A50T-1FTG256C\n（Optional） Logic Cells 52160   DSP 120   CLBs 65200   Block RAM(Kb) 2700   CMTs 5   XC7A75T-1FTG256C\n（Optional）  Logic Cells 75520   DSP 180   CLBs 94400   Block RAM(Kb) 3780   CMTs 6   XC7A100T-1FTG256C\n（Optional） Logic Cells 101440   DSP 240   CLBs 126800   Block RAM(Kb) 4680   CMTs 6   FPGA FLASH 1 N25Q064A 8MB(64Mbit)   RISC-V FLASH 1 N25Q064A 8MB(64Mbit)   DDR3 1 MT41J128M16JT 256MB(16Megx16x8Banks)   Supported RISC-V Cores  X-Core by PerfXLab Hummingbird E200 Syntacore SCR1 UCTechIP WH32 (only on Perf-V 100T)  Partners  Where to Buy  PerfXLab shop on Taobao (for China) PerfXLab shop on AliExpress (in English for overseas)  ","href":"/","title":"Home"},{"content":"","href":"/tags/new-features.html","title":"New Features"},{"content":"","href":"/page.html","title":"Pages"},{"content":"","href":"/posts.html","title":"Posts"},{"content":" var _hmt = _hmt || []; (function () { var hm = document.createElement(\"script\"); hm.src = \"https://hm.baidu.com/hm.js?72da874e46df0db06656968a66188744\"; var s = document.getElementsByTagName(\"script\")[0]; s.parentNode.insertBefore(hm, s); })();   PerfXLab shop on Taobao (for China) PerfXLab shop on AliExpress (in English for overseas)  ","href":"/purchase.html","title":"Purchase"},{"content":"","href":"/series.html","title":"Series"},{"content":"","href":"/tags.html","title":"Tags"},{"content":"","href":"/tags/usb.html","title":"USB"},{"content":"","href":"/tags/perf-v.html","title":"perf-v"},{"content":"","href":"/tags/x-core.html","title":"x-core"}]
